art_museum = [
    'музей_изобразительных_искусств', 'музей изобразительных искусств', 'музея изобразительных искусств',
    'музею изобразительных искусств', 'музеем изобразительных искусств', 'музее изобразительных искусств'
]

exhibition_hall_of_the_museum_of_fine_arts = [
    'выставочный_зал_музея_изобразительных_искусств', 'выставочный зал музея изобразительных искусств',
    'выставочного зала музея изобразительных искусств', 'выставочному залу музея изобразительных искусств',
    'выставочным залом музея изобразительных искусств', 'выставочном зале музея изобразительных искусств',
]

kazan_cathedral = [
    'казанский_кафедральный_собор', 'казанский кафедральный собор', 'казанского кафедрального собора',
    'казанскому кафедральному собору', 'казанским кафедральным собором', 'казанском кафедральном соборе',
]

regional_philharmonic = [
    'областная_филармония', 'областная филармония', 'областной филармонии', 'областную филармонию',
    'областной филармонией'
]

avant_garde = ['авангард', 'авангарда', 'авангарду', 'авангардом', 'авангарде', 'авангард']

scientific_library = [
    'научная_библиотека', 'научная библиотека', 'научной библиотеки', 'научной библиотеке', 'научную библиотеку',
    'научной библиотекой'
]

square_of_the_fallen_fighters = [
    'площадь_павших_борцов', 'площадью павших борцов', 'площадь павших борцов', 'площади павших борцов'
]

monument_to_sasha_filipov = [
    'памятник_саше_филиппову', 'памятника саше филиппову', 'памятнику саше филиппову',
    'памятником саше филиппову', 'памятнике саше филиппову', 'памятник саше филиппову'
]

museum_of_the_history_of_the_kirov_region = [
    'музей_истории_кировского_района', 'музей истории кировского района', 'музея истории кировского района',
    'музею истории кировского района', 'музеем истории кировского района', 'музее истории кировского района'
]

monument_to_the_chekists = [
    'памятник_чекистам', 'памятника чекистам', 'памятнику чекистам', 'памятником чекистам',
    'памятнике чекистам', 'памятник чекистам'
]

armenian_church_of_st_george = [
    'армянская_церковь_святого_георгия', 'армянская церковь святого георгия', 'армянской церкви святого георгия',
    'армянской церкви святого георгия', 'армянскую церковь святого георгия', 'армянской церковью святого георгия'
]

monument_tram = [
    'трамвай_памятник', 'трамвай памятник', 'трамвая памятника', 'трамваю памятнику', 'трамваем памятником',
    'трамвае памятнике'
]

military_train = [
    'воинский_эшелон', 'воинский эшелон', 'воинского эшелона', 'воинскому эшелону', 'воинский эшелон',
    'воинским эшелоном', 'воинском эшелоне'
]

gergardts_mill = [
    'мельница_гергардта', 'мельница гергардта', 'мельницы гергардта', 'мельницу гергардта',
    'мельницей гергардта', 'мельнице гергардта'
]

dzerzhinsky_monument = [
    'памятник_дзержинскому', 'памятника дзержинскому', 'памятнику дзержинскому',
    'памятником дзержинскому', 'памятнике дзержинскому', 'памятник дзержинскому'
]

tsaritsyn_fire_brigade_building = [
    'здание_царицынской_пожарной_команды', 'зданием царицынской пожарной команды',
    'здания царицынской пожарной команды', 'зданию царицынской пожарной команды', 'здание царицынской пожарной команды',
    'здании царицынской пожарной команды'
]

pavlovs_house = ['дом_павлова', 'дома павлова', 'дому павлова', 'домом павлова', 'доме павлова', 'дом павлова']

chelyabinsk_collective_farmer = [
    'челябинский_колхозник', 'челябинский колхозник', 'челябинского колхозника', 'челябинскому колхознику',
    'челябинским колхозником', 'челябинском колхознике'
]

bk_13 = [
    'бк_13', 'бронекатера бк-13', 'бронекатеру бк-13', 'бронекатером бк-13', 'бронекатере бк-13',
    'бронекатера бк 13', 'бронекатеру бк 13', 'бронекатером бк 13', 'бронекатере бк 13',
    'бронекатер бк-13', 'бронекатер бк 13', 'бк-13', 'бк 13'
]

beit_david = [
    'бейт_давид', 'бейт-давида', 'бейт-давиду', 'бейт-давидом', 'бейт-давиде', 'бейт давида', 'бейт давиду',
    'бейт давидом', 'бейт давиде', 'бейт-давид', 'бейт давид'
]

barmaley = ['бармалей', 'бармалей', 'бармалея', 'бармалею', 'бармалеем', 'бармалее']

bald_mountain = ['лысая_гора', 'лысая гора', 'лысой горы', 'лысой горе', 'лысую гору', 'лысой горой']

elevator = ['элеватор', 'элеватора', 'элеватору', 'элеватором', 'элеваторе', 'элеватор']

panikha_monument = [
    'памятник_паникахе', 'памятника паникахе', 'памятнику паникахе', 'памятником паникахе', 'памятнике паникахе',
    'памятник паникахе'
]

fountain_of_lovers = [
    'фонтан_влюбленных', 'фонтана влюбленных', 'фонтану влюбленных', 'фонтаном влюбленных',
    'фонтане влюбленных', 'фонтан влюбленных'
]

lukonins_apartment_museum = [
    'музей_квартира_луконина', 'музей-квартира луконина', 'музей-квартиры луконина', 'музей-квартире луконина',
    'музей-квартиру луконина', 'музей-квартирой луконина'
]

museum_and_exhibition_center_of_the_krasnoarmeysky_district = [
    'музейно_выставочный_центр_красноармейского_района', 'музейно-выставочный центр красноармейского района',
    'музейно-выставочного центра красноармейского района', 'музейно-выставочному центру красноармейского района',
    'музейно-выставочным центром красноармейского района', 'музейно-выставочном центре красноармейского района',
]

mamayev_kurgan = [
    'мамаев_курган', 'мамаева кургана', 'мамаеву кургану', 'мамаевом курганом', 'мамаеве кургане',
    'мамаевом кургане', 'мамаев курган'
]

river_port = ['речной_порт', 'речной порт', 'речного порта', 'речному порту', 'речным портом', 'речном порте']

tsaritsyn_opera = [
    'царицынская_опера', 'царицынская опера', 'царицынской оперы', 'царицынской опере',
    'царицынскую оперу', 'царицынской оперой'
]

health_history_museum = [
    'музей_истории_здравоохранения', 'музей истории здравоохранения', 'музея истории здравоохранения',
    'музею истории здравоохранения', 'музеем истории здравоохранения', 'музее истории здравоохранения',
]

museum_children_of_tsaritsyn_stalingrad_volgograd = [
    'музей_дети_царицына_сталинграда_волгограда', 'музей "дети царицына, сталинграда, волгограда"',
    'музея "дети царицына, сталинграда, волгограда"', 'музею "дети царицына, сталинграда, волгограда"',
    'музеем "дети царицына, сталинграда, волгограда"', 'музее "дети царицына, сталинграда, волгограда"'
]

peoples_museum_of_volgograd_railway_workers = [
    'народный_музей_волгоградских_железнодорожников', 'народный музей волгоградских железнодорожников',
    'народного музея волгоградских железнодорожников', 'народному музею волгоградских железнодорожников',
    'народным музеем волгоградских железнодорожников', 'народном музее волгоградских железнодорожников',
]

aviation_museum = [
    'музей_авиации', 'музей авиации', 'музея авиации', 'музею авиации', 'музеем авиации', 'музее авиации'
]

tsaritsyn_stalingrad_volgograd_military_patriotic_museum_of_the_history_of_communications_and_radio_amateurism = [
    'военно_патриотический_музей_истории_связи_и_радиолюбительства_царицына_сталинграда_волгограда',
    'военно-патриотический музей истории связи и радиолюбительства царицына-сталинграда-волгограда',
    'военно-патриотического музея истории связи и радиолюбительства царицына-сталинграда-волгограда',
    'военно-патриотическому музею истории связи и радиолюбительства царицына-сталинграда-волгограда',
    'военно-патриотическим музеем истории связи и радиолюбительства царицына-сталинграда-волгограда',
    'военно-патриотическом музее истории связи и радиолюбительства царицына-сталинграда-волгограда',
]

park_named_after_yuri_gagarin = [
    'парк_имени_юрия_гагарина', 'парка имени юрия гагарина', 'парку имени юрия гагарина',
    'парком имени юрия гагарина', 'парке имени юрия гагарина', 'парк имени юрия гагарина',
    'парка гагарина', 'парку гагарина', 'парком гагарина', 'парке гагарина'
]

museum_of_the_history_of_the_volga_don_shipping_channel = [
    'музей_истории_волго_донского_судоходного_канала', 'музей "истории волго-донского судоходного канала"',
    'музея "истории волго-донского судоходного канала"', 'музею "истории волго-донского судоходного канала"',
    'музеем "истории волго-донского судоходного канала"', 'музее "истории волго-донского судоходного канала"'
]

exhibition_hall_of_the_volgograd_regional_organization_of_the_union_of_artists_of_russia = [
    'выставочный_зал_волгоградской_областной_организации_союза_художников_россии',
    'выставочный зал волгоградской областной организации союза художников россии',
    'выставочного зала волгоградской областной организации союза художников россии',
    'выставочному залу волгоградской областной организации союза художников россии',
    'выставочным залом волгоградской областной организации союза художников россии',
    'выставочном зале волгоградской областной организации союза художников россии'
]

victory_park = ['парк_победы', 'парка победы', 'парку победы', 'парком победы', 'парке победы', 'парк победы']

komsomol_garden = [
    'комсомольский_сад', 'комсомольский сад', 'комсомольского сада', 'комсомольскому саду', 'комсомольским садом',
    'комсомольском саде', 'комсомольском саду'
]

childrens_city_park = [
    'детский_городской_парк', 'детский городской парк', 'детского городского парка', 'детскому городскому парку',
    'детским городским парком', 'детском городском парке'
]

sasha_filippov_square = [
    'сквер_имени_саши_филиппова', 'сквера имени саши филиппова', 'скверу имени саши филиппова',
    'сквером имени саши филиппова', 'сквере имени саши филиппова', 'сквера саши филиппова',
    'скверу саши филиппова', 'сквером саши филиппова', 'сквере саши филиппова',
    'сквер имени саши филиппова', 'сквер саши филиппова'
]

friendship_park = ['парк_дружбы', 'парка дружбы', 'парку дружбы', 'парком дружбы', 'парке дружбы', 'парк дружбы']

hall_of_military_glory = [
    'зал_воинской_славы', 'зала воинской славы', 'залу воинской славы', 'залом воинской славы', 'зале воинской славы',
    'зал воинской славы'
]

botanical_garden_vgspu = [
    'ботанический_сад_вгспу', 'ботанический сад вгспу', 'ботанического сада вгспу', 'ботаническому саду вгспу',
    'ботаническим садом вгспу', 'ботаническом саде вгспу'
]

tspkio = [
    'цпкио', 'цпкио', 'центральный парк культуры и отдыха', 'центрального парка культуры и отдыха',
    'центральному парку культуры и отдыха', 'центральным парком культуры и отдыха',
    'центральном парке культуры и отдыха'
]

museum_of_musical_instruments = [
    'музей_музыкальных_инструментов', 'музей музыкальных инструментов', 'музея музыкальных инструментов',
    'музею музыкальных инструментов', 'музеем музыкальных инструментов', 'музее музыкальных инструментов',
]

museum_of_weights_and_measures = [
    'музей_мер_и_весов', 'музей мер и весов', 'музея мер и весов', 'музею мер и весов', 'музеем мер и весов',
    'музее мер и весов'
]

regional_museum_of_local_lore = [
    'областной_краеведческий_музей', 'областной краеведческий музей', 'областного краеведческого музея',
    'областному краеведческому музею', 'областным краеведческим музеем', 'областном краеведческом музее'
]

museum_reserve_old_sarepta = [
    'музей_заповедник_старая_сарепта', 'музей заповедник "старая сарепта"', 'музея заповедника "старая сарепта"',
    'музею заповеднику "старая сарепта"', 'музеем заповедником "старая сарепта"', 'музее заповеднике "старая сарепта"'
]

planetarium = ['планетарий', 'планетарий', 'планетария', 'планетарию', 'планетарием', 'планетарии']

museum_memory = [
    'музей_память', 'музей память', 'музея память', 'музею память', 'музеем память', 'музее память',
    'музей "память"', 'музея "память"', 'музею "память"', 'музеем "память"', 'музее "память"',
]

museum_panorama_battle_of_stalingrad = [
    'музей_панорама_сталинградская_битва', 'музей-панорама "сталинградская битва"',
    'музея-панорамы "сталинградская битва"', 'музею-панораме "сталинградская битва"',
    'музеем-панорамой "сталинградская битва"', 'музее-панораме "сталинградская битва"'
]

memorial_history_museum = [
    'мемориально_исторический_музей', 'мемориально-исторический музей', 'мемориально-исторического музея',
    'мемориально-историческому музею', 'мемориально-историческим музеем', 'мемориально-историческом музее'
]

city_garden = [
    'горсад', 'горсада', 'горсаду', 'горсадом', 'горсаде', 'горсад'
    'городской сад', 'городского сада', 'городскому саду', 'городским садом', 'городском саде'
]

volgograd_arena = [
    'волгоград_арена', 'волгоград арена', 'волгоград арены', 'волгоград арене', 'волгоград арену', 'волгоград ареной',
    'волгоград арене', '"волгоград арена"', '"волгоград арены"', '"волгоград арене"', '"волгоград арену"',
    '"волгоград ареной"', '"волгоград арене"'
]
