bocharov = ['андрей_бочаров', 'Андрей Бочаров', 'Бочаров Андрей', 'Андрея Бочарова', 'Бочарова Андрея',
            'Андрею Бочарову', 'Бочарову Андрею', 'Андреем Бочаровым', 'Бочаровым Андреем', 'Андрее Бочарове',
            'Бочарове Андрее',
            'Бочарова', 'Бочарову', 'Бочаровым', 'Бочарове', 'Бочаров']

pisemskaya = ['анна_писемская', 'Анна Писемская', 'Писемская Анна', 'Анны Писемской', 'Писемской Анны',
              'Анне Писемской', 'Писемской Анне', 'Анну Писемскую', 'Писемскую Анну', 'Анной Писемской',
              'Писемской Анной',
              'Писемская', 'Писемскую', 'Писемской']

ivanov = ['василий_иванов', 'Василий Иванов', 'Иванов Василий', 'Василия Иванова', 'Иванова Василия', 'Василию Иванову',
          'Иванову Василию', 'Василием Ивановым', 'Ивановым Висилием', 'Василии Иванове', 'Иванове Василии',
          'Иванова', 'Иванову', 'Ивановым', 'Иванове', 'Иванов']

savchenko = ['олег_савченко', 'Олег Савченко', 'Савченко Олег', 'Олега Савченко', 'Савченко Олега', 'Олегу Савченко',
             'Савченко Олегу', 'Олегом Савченко', 'Савченко Олегом', 'Олеге Савченко', 'Савченко Олеге',
             'Савченко']

bikadorova = ['галина_быкадорова', 'Галина Быкадорова', 'Быкадорова Галина', 'Галины Быкадоровой', 'Быкадоровой Галины',
              'Галине Быкадоровой', 'Быкадоровой Галине', 'Галину Быкадорову', 'Быкадорову Галину',
              'Галиной Быкадоровой', 'Быкадоровой Галиной',
              'Быкадорову', 'Быкадоровой', 'Быкадорова']

likhachev = ['виталий_лихачев', 'Виталий Лихачев', 'Лихачев Виталий', 'Виталия Лихачева', 'Лихачева Виталия',
             'Виталию Лихачеву', 'Лихачеву Виталию', 'Виталием Лихачевым', 'Лихачевым Виталием', 'Виталии Лихачеве',
             'Лихачеве Виталии',
             'Лихачева', 'Лихачеву', 'Лихачевым', 'Лихачеве', 'Лихачев']

rusaev = ['владимир_русаев', 'Владимир Русаев', 'Русаев Владимир', 'Владимира Русаева', 'Русаева Владимира',
          'Владимиру Русаеву', 'Русаеву Владимиру', 'Владимиром Русаевым', 'Русаевым Владимиром', 'Владимире Русаеве',
          'Русаеве Владимире',
          'Русаева', 'Русаеву', 'Русаевым', 'Русаеве', 'Русаев']

zemtsov = ['виталий_земцов', 'Виталий Земцов', 'Земцов Виталий', 'Виталия Земцова', 'Земцова Виталия',
           'Виталию Земцову', 'Земцову Виталию', 'Виталием Земцовым', 'Земцовым Виталием', 'Виталии Земцове',
           'Земцове Виталии',
           'Земцова', 'Земцову', 'Земцовым', 'Земцове', 'Земцов']

afanasova = ['виктория_афанасова', 'Виктория Афанасова', 'Афанасова Виктория', 'Виктории Афанасовой',
             'Афанасовой Виктории', 'Викторию Афанасову', 'Афанасову Викторию', 'Викторией Афанасовой',
             'Афанасовой Викторией',
             'Афанасову', 'Афанасовой', 'Афанасова']

cherepakhin = ['вячеслав_черепахин', 'Вячеслав Черепахин', 'Черепахин Вячеслав', 'Вячеслава Черепахина',
               'Черепахина Вячеслава', 'Вячеславу Черепахину', 'Черепахину Вячеславу', 'Вячеславом Черепахиным',
               'Черепахиным Вячеславом', 'Вячеславе Черепахине', 'Черепахине Вячеславе',
               'Черепахина', 'Черепахину', 'Черепахиным', 'Черепахине', 'Черепахин']

sharifov = ['руслан_шарифов', 'Руслан Шарифов', 'Шарифов Руслан', 'Руслана Шарифова', 'Шарифова Руслана',
            'Руслану Шарифову', 'Шарифову Руслану', 'Русланом Шарифовым', 'Шарифовым Русланом', 'Руслане Шарифове',
            'Шарифове Руслане',
            'Шарифова', 'Шарифову', 'Шарифовым', 'Шарифове', 'Шарифов']

dorzhdeev = ['александр_дорждеев', 'Александр Дорждеев', 'Дорждеев Александр', 'Александра Дорждеева',
             'Дорждеева Александра', 'Александру Дорждееву', 'Дорждееву Александру', 'Александром Дорждеевым',
             'Дорждеевым Александром', 'Александре Дорждееве', 'Дорждееве Александре',
             'Дорждеева', 'Дорждееву', 'Дорждеевым', 'Дорждееве', 'Дорждеев']

mogilniy = ['валерий_могильный', 'Валерий Могильный', 'Могильный Валерий', 'Валирия Могильного', 'Могильного Валерия',
            'Валерию Могильному', 'Могильному Валерию', 'Валерием Могильным', 'Могильным Валерием', 'Валерии Могильном',
            'Могильном Валерии',
            'Могильного', 'Могильный', 'Могильным', 'Могильному', 'Могильном']

sakharova = ['наталья_сахарова', 'Наталья Сахарова', 'Сахарова Наталья', 'Натальи Сахаровой', 'Сахаровой Натальи',
             'Наталье Сахаровой', 'Сахаровой Наталье', 'Наталью Сахарову', 'Сахарову Наталью', 'Натальей Сахаровой',
             'Сахаровой Натальей',
             'Сахарова', 'Сахарову', 'Сахоровой']

sudarev = ['юрий_сударев', 'Юрий Сударев', 'Сударев Юрий', 'Юрия Сударева', 'Сударева Юрия', 'Юрию Судареву',
           'Судареву Юрию', 'Юрием Сударевым', 'Судеревым Юрием', 'Юрии Судареве', 'Судареве Юрии',
           'Сударева', 'Судареву', 'Сударевым', 'Судареве', 'Сударев']

potapova = ['алена_потапова', 'Алена Потапова', 'Алёна Потапова', 'Потапова Алена', 'Потапова Алёна', 'Алены Потаповой',
            'Алёны Потаповой', 'Потаповой Алены', 'Потаповой Алёны', 'Алене Потаповой', 'Алёне Потаповой',
            'Потаповой Алене', 'Потавовой Алёне', 'Алену Потапову', 'Алёну Потапову', 'Потапову Алену',
            'Потапову Алёну', 'Аленой Потаповой', 'Алёной Потаповой', 'Потаповой Аленой', 'Потаповой Алёной',
            'Потапова', 'Потапову', 'Потаповой']

bakhin = ['валерий_бахин', 'Валерий Бахин', 'Бахин Валерий', 'Валерия Бахина', 'Бахина Валерия', 'Валерию Бахину',
          'Бахину Валерию', 'Валерием Бахиным', 'Бахиным Валерием', 'Валерии Бахине', 'Бахине Валерии',
          'Бахина', 'Бахину', 'Бахиным', 'Бахине', 'Бахин']

merzhoeva = ['зина_мержоева', 'Зина Мержоева', 'Мержоева Зина', 'Зины Мержоевой', 'Мержоевой Зины', 'Зину Мержоеву',
             'Мержоеву Зину', 'Зиной Мержоевой', 'Мержоевой Зиной', 'Зине Мержоевой', 'Мержоеве Зине',
             'Мержоева', 'Мержоевой', 'Мержоеву']

savina = ['лариса_савина', 'Лариса Савина', 'Савина Лариса', 'Ларисы Савиной', 'Савиной Ларисы', 'Ларису Савину',
          'Савину Ларису', 'Ларисой Савиной', 'Савиной Ларисой', 'Ларисе Савиной', 'Савиной Ларисе',
          'Савина', 'Савиной', 'Савину']

nikolaev = ['олег_николаев', 'Олег Николаев', 'Николаев Олег', 'Олега Николаева', 'Николаева Олега', 'Олегу Николаеву',
            'Николаеву Олегу', 'Олегом Николаевым', 'Николаевым Олегом', 'Олеге Николаеве', 'Николаеве Олеге',
            'Николаева', 'Николаеву', 'Николаевым', 'Николаеве', 'Николаев']


# bocharov = ['андрей_бочаров', 'андрей бочаров', 'бочаров андрей', 'андрея бочарова', 'бочарова андрея',
#             'андрею бочарову', 'бочарову андрею', 'андреем бочаровым', 'бочаровым андреем', 'андрее бочарове',
#             'бочарове андрее',
#             'бочарова', 'бочарову', 'бочаровым', 'бочарове', 'бочаров']
#
# pisemskaya = ['анна_писемская', 'анна писемская', 'писемская анна', 'анны писемской', 'писемской анны',
#               'анне писемской', 'писемской анне', 'анну писемскую', 'писемскую анну', 'анной писемской',
#               'писемской анной',
#               'писемская', 'писемскую', 'писемской']
#
# ivanov = ['василий_иванов', 'василий иванов', 'иванов василий', 'василия иванова', 'иванова василия', 'василию иванову',
#           'иванову василию', 'василием ивановым', 'ивановым висилием', 'василии иванове', 'иванове василии',
#           'иванова', 'иванову', 'ивановым', 'иванове', 'иванов']
#
# savchenko = ['олег_савченко', 'олег савченко', 'савченко олег', 'олега савченко', 'савченко олега', 'олегу савченко',
#              'савченко олегу', 'олегом савченко', 'савченко олегом', 'олеге савченко', 'савченко олеге',
#              'савченко']
#
# bikadorova = ['галина_быкадорова', 'галина быкадорова', 'быкадорова галина', 'галины быкадоровой', 'быкадоровой галины',
#               'галине быкадоровой', 'быкадоровой галине', 'галину быкадорову', 'быкадорову галину',
#               'галиной быкадоровой', 'быкадоровой галиной',
#               'быкадорову', 'быкадоровой', 'быкадорова']
#
# likhachev = ['виталий_лихачев', 'виталий лихачев', 'лихачев виталий', 'виталия лихачева', 'лихачева виталия',
#              'виталию лихачеву', 'лихачеву виталию', 'виталием лихачевым', 'лихачевым виталием', 'виталии лихачеве',
#              'лихачеве виталии',
#              'лихачева', 'лихачеву', 'лихачевым', 'лихачеве', 'лихачев']
#
# rusaev = ['владимир_русаев', 'владимир русаев', 'русаев владимир', 'владимира русаева', 'русаева владимира',
#           'владимиру русаеву', 'русаеву владимиру', 'владимиром русаевым', 'русаевым владимиром', 'владимире русаеве',
#           'русаеве владимире',
#           'русаева', 'русаеву', 'русаевым', 'русаеве', 'русаев']
#
# zemtsov = ['виталий_земцов', 'виталий земцов', 'земцов виталий', 'виталия земцова', 'земцова виталия',
#            'виталию земцову', 'земцову виталию', 'виталием земцовым', 'земцовым виталием', 'виталии земцове',
#            'земцове виталии',
#            'земцова', 'земцову', 'земцовым', 'земцове', 'земцов']
#
# afanasova = ['виктория_афанасова', 'виктория афанасова', 'афанасова виктория', 'виктории афанасовой',
#              'афанасовой виктории', 'викторию афанасову', 'афанасову викторию', 'викторией афанасовой',
#              'афанасовой викторией',
#              'афанасову', 'афанасовой', 'афанасова']
#
# cherepakhin = ['вячеслав_черепахин', 'вячеслав черепахин', 'черепахин вячеслав', 'вячеслава черепахина',
#                'черепахина вячеслава', 'вячеславу черепахину', 'черепахину вячеславу', 'вячеславом черепахиным',
#                'черепахиным вячеславом', 'вячеславе черепахине', 'черепахине вячеславе',
#                'черепахина', 'черепахину', 'черепахиным', 'черепахине', 'черепахин']
#
# sharifov = ['руслан_шарифов', 'руслан шарифов', 'шарифов руслан', 'руслана шарифова', 'шарифова руслана',
#             'руслану шарифову', 'шарифову руслану', 'русланом шарифовым', 'шарифовым русланом', 'руслане шарифове',
#             'шарифове руслане',
#             'шарифова', 'шарифову', 'шарифовым', 'шарифове', 'шарифов']
#
# dorzhdeev = ['александр_дорждеев', 'александр дорждеев', 'дорждеев александр', 'александра дорждеева',
#              'дорждеева александра', 'александру дорждееву', 'дорждееву александру', 'александром дорждеевым',
#              'дорждеевым александром', 'александре дорждееве', 'дорждееве александре',
#              'дорждеева', 'дорждееву', 'дорждеевым', 'дорждееве', 'дорждеев']
#
# mogilniy = ['валерий_могильный', 'валерий могильный', 'могильный валерий', 'валирия могильного', 'могильного валерия',
#             'валерию могильному', 'могильному валерию', 'валерием могильным', 'могильным валерием', 'валерии могильном',
#             'могильном валерии',
#             'могильного', 'могильный', 'могильным', 'могильному', 'могильном']
#
# sakharova = ['наталья_сахарова', 'наталья сахарова', 'сахарова наталья', 'натальи сахаровой', 'сахаровой натальи',
#              'наталье сахаровой', 'сахаровой наталье', 'наталью сахарову', 'сахарову наталью', 'натальей сахаровой',
#              'сахаровой натальей',
#              'сахарова', 'сахарову', 'сахоровой']
#
# sudarev = ['юрий_сударев', 'юрий сударев', 'сударев юрий', 'юрия сударева', 'сударева юрия', 'юрию судареву',
#            'судареву юрию', 'юрием сударевым', 'судеревым юрием', 'юрии судареве', 'судареве юрии',
#            'сударева', 'судареву', 'сударевым', 'судареве', 'сударев']
#
# potapova = ['алена_потапова', 'алена потапова', 'алёна потапова', 'потапова алена', 'потапова алёна', 'алены потаповой',
#             'алёны потаповой', 'потаповой алены', 'потаповой алёны', 'алене потаповой', 'алёне потаповой',
#             'потаповой алене', 'потавовой алёне', 'алену потапову', 'алёну потапову', 'потапову алену',
#             'потапову алёну', 'аленой потаповой', 'алёной потаповой', 'потаповой аленой', 'потаповой алёной',
#             'потапова', 'потапову', 'потаповой']
#
# bakhin = ['валерий_бахин', 'валерий бахин', 'бахин валерий', 'валерия бахина', 'бахина валерия', 'валерию бахину',
#           'бахину валерию', 'валерием бахиным', 'бахиным валерием', 'валерии бахине', 'бахине валерии',
#           'бахина', 'бахину', 'бахиным', 'бахине', 'бахин']
#
# merzhoeva = ['зина_мержоева', 'зина мержоева', 'мержоева зина', 'зины мержоевой', 'мержоевой зины', 'зину мержоеву',
#              'мержоеву зину', 'зиной мержоевой', 'мержоевой зиной', 'зине мержоевой', 'мержоеве зине',
#              'мержоева', 'мержоевой', 'мержоеву']
#
# savina = ['лариса_савина', 'лариса савина', 'савина лариса', 'ларисы савиной', 'савиной ларисы', 'ларису савину',
#           'савину ларису', 'ларисой савиной', 'савиной ларисой', 'ларисе савиной', 'савиной ларисе',
#           'савина', 'савиной', 'савину']
#
# nikolaev = ['олег_николаев', 'олег николаев', 'николаев олег', 'олега николаева', 'николаева олега', 'олегу николаеву',
#             'николаеву олегу', 'олегом николаевым', 'николаевым олегом', 'олеге николаеве', 'николаеве олеге',
#             'николаева', 'николаеву', 'николаевым', 'николаеве', 'николаев']
